paparazzi/paparazzi/sw/airborne/subsystems/radio_control/cc2500_frsky/cc2500_rx.c
#include "cc2500_compat.h"

#include "cc2500_rx.h"
#include "cc2500_rx_spi.h"
#include "cc2500_settings.h"

#define UNUSED(x) (void)(x)

// CAUTION: LARGE PARTS OF THIS FILE ARE COMMENTED OUT!
// betaflight/src/main/rx/rx.c @ 79dd6b6
/*
 * This file is part of Cleanflight and Betaflight.
 *
 * Cleanflight and Betaflight are free software. You can redistribute
 * this software and/or modify this software under the terms of the
 * GNU General Public License as published by the Free Software
 * Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * Cleanflight and Betaflight are distributed in the hope that they
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied
 * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>

#include <string.h>
//
//#include "platform.h"
//
//#include "build/build_config.h"
//#include "build/debug.h"
//
//#include "common/maths.h"
//#include "common/utils.h"
//#include "common/filter.h"
//
//#include "config/config_reset.h"
//#include "config/feature.h"
//
//#include "drivers/adc.h"
//#include "drivers/rx/rx_pwm.h"
//#include "drivers/rx/rx_spi.h"
//#include "drivers/time.h"
//
//#include "config/config.h"
//#include "fc/rc_controls.h"
//#include "fc/rc_modes.h"
//
//#include "flight/failsafe.h"
//
//#include "io/serial.h"
//
//#include "pg/pg.h"
//#include "pg/pg_ids.h"
//#include "pg/rx.h"
//
//#include "rx/rx.h"
//#include "rx/pwm.h"
//#include "rx/fport.h"
//#include "rx/sbus.h"
//#include "rx/spektrum.h"
//#include "rx/srxl2.h"
//#include "rx/sumd.h"
//#include "rx/sumh.h"
//#include "rx/msp.h"
//#include "rx/xbus.h"
//#include "rx/ibus.h"
//#include "rx/jetiexbus.h"
//#include "rx/crsf.h"
//#include "rx/rx_spi.h"
//#include "rx/targetcustomserial.h"
//
//
//const char rcChannelLetters[] = "AERT12345678abcdefgh";

static uint16_t rssi = 0;                  // range: [0;1023]
//static uint8_t rssi_dbm = 130;             // range: [0;130] display 0 to -130
//static timeUs_t lastMspRssiUpdateUs = 0;
//
static pt1Filter_t frameErrFilter;
//
//#ifdef USE_RX_LINK_QUALITY_INFO
//static uint16_t linkQuality = 0;
//#endif
//
//#define MSP_RSSI_TIMEOUT_US 1500000   // 1.5 sec
//
//#define RSSI_ADC_DIVISOR (4096 / 1024)
//#define RSSI_OFFSET_SCALING (1024 / 100.0f)

rssiSource_e rssiSource;
//linkQualitySource_e linkQualitySource;

static bool rxDataProcessingRequired = false;
static bool auxiliaryProcessingRequired = false;

static bool rxSignalReceived = false;
//static bool rxFlightChannelsValid = false;
static bool rxIsInFailsafeMode = true;
static uint8_t rxChannelCount;

static timeUs_t rxNextUpdateAtUs = 0;
static uint32_t needRxSignalBefore = 0;
static uint32_t needRxSignalMaxDelayUs;
//static uint32_t suspendRxSignalUntil = 0;
//static uint8_t  skipRxSamples = 0;
//
//static int16_t rcRaw[MAX_SUPPORTED_RC_CHANNEL_COUNT];     // interval [1000;2000]
int16_t rcData[MAX_SUPPORTED_RC_CHANNEL_COUNT];     // interval [1000;2000]
uint32_t rcInvalidPulsPeriod[MAX_SUPPORTED_RC_CHANNEL_COUNT];

#define MAX_INVALID_PULS_TIME    300
//#define PPM_AND_PWM_SAMPLE_COUNT 3
//
//#define DELAY_50_HZ (1000000 / 50)
//#define DELAY_33_HZ (1000000 / 33)
#define DELAY_10_HZ (1000000 / 10)
//#define DELAY_5_HZ (1000000 / 5)
//#define SKIP_RC_ON_SUSPEND_PERIOD 1500000           // 1.5 second period in usec (call frequency independent)
//#define SKIP_RC_SAMPLES_ON_RESUME  2                // flush 2 samples to drop wrong measurements (timing independent)

rxRuntimeState_t rxRuntimeState;
static uint8_t rcSampleIndex = 0;
//
//PG_REGISTER_ARRAY_WITH_RESET_FN(rxChannelRangeConfig_t, NON_AUX_CHANNEL_COUNT, rxChannelRangeConfigs, PG_RX_CHANNEL_RANGE_CONFIG, 0);
//void pgResetFn_rxChannelRangeConfigs(rxChannelRangeConfig_t *rxChannelRangeConfigs)
//{
//    // set default calibration to full range and 1:1 mapping
//    for (int i = 0; i < NON_AUX_CHANNEL_COUNT; i++) {
//        rxChannelRangeConfigs[i].min = PWM_RANGE_MIN;
//        rxChannelRangeConfigs[i].max = PWM_RANGE_MAX;
//    }
//}
//
//PG_REGISTER_ARRAY_WITH_RESET_FN(rxFailsafeChannelConfig_t, MAX_SUPPORTED_RC_CHANNEL_COUNT, rxFailsafeChannelConfigs, PG_RX_FAILSAFE_CHANNEL_CONFIG, 0);
//void pgResetFn_rxFailsafeChannelConfigs(rxFailsafeChannelConfig_t *rxFailsafeChannelConfigs)
//{
//    for (int i = 0; i < MAX_SUPPORTED_RC_CHANNEL_COUNT; i++) {
//        rxFailsafeChannelConfigs[i].mode = (i < NON_AUX_CHANNEL_COUNT) ? RX_FAILSAFE_MODE_AUTO : RX_FAILSAFE_MODE_HOLD;
//        rxFailsafeChannelConfigs[i].step = (i == THROTTLE)
//            ? CHANNEL_VALUE_TO_RXFAIL_STEP(RX_MIN_USEC)
//            : CHANNEL_VALUE_TO_RXFAIL_STEP(RX_MID_USEC);
//    }
//}
//
//void resetAllRxChannelRangeConfigurations(rxChannelRangeConfig_t *rxChannelRangeConfig) {
//    // set default calibration to full range and 1:1 mapping
//    for (int i = 0; i < NON_AUX_CHANNEL_COUNT; i++) {
//        rxChannelRangeConfig->min = PWM_RANGE_MIN;
//        rxChannelRangeConfig->max = PWM_RANGE_MAX;
//        rxChannelRangeConfig++;
//    }
//}

static uint16_t nullReadRawRC(const rxRuntimeState_t *rxRuntimeState, uint8_t channel)
{
    UNUSED(rxRuntimeState);
    UNUSED(channel);

    return PPM_RCVR_TIMEOUT;
}

static uint8_t nullFrameStatus(rxRuntimeState_t *rxRuntimeState)
{
    UNUSED(rxRuntimeState);

    return RX_FRAME_PENDING;
}

static bool nullProcessFrame(const rxRuntimeState_t *rxRuntimeState)
{
    UNUSED(rxRuntimeState);

    return true;
}

//STATIC_UNIT_TESTED bool isPulseValid(uint16_t pulseDuration)
//{
//    return  pulseDuration >= rxConfig()->rx_min_usec &&
//            pulseDuration <= rxConfig()->rx_max_usec;
//}
//
//#ifdef USE_SERIAL_RX
//static bool serialRxInit(const rxConfig_t *rxConfig, rxRuntimeState_t *rxRuntimeState)
//{
//    bool enabled = false;
//    switch (rxRuntimeState->serialrxProvider) {
//#ifdef USE_SERIALRX_SRXL2
//    case SERIALRX_SRXL2:
//        enabled = srxl2RxInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_SPEKTRUM
//    case SERIALRX_SRXL:
//    case SERIALRX_SPEKTRUM1024:
//    case SERIALRX_SPEKTRUM2048:
//        enabled = spektrumInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_SBUS
//    case SERIALRX_SBUS:
//        enabled = sbusInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_SUMD
//    case SERIALRX_SUMD:
//        enabled = sumdInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_SUMH
//    case SERIALRX_SUMH:
//        enabled = sumhInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_XBUS
//    case SERIALRX_XBUS_MODE_B:
//    case SERIALRX_XBUS_MODE_B_RJ01:
//        enabled = xBusInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_IBUS
//    case SERIALRX_IBUS:
//        enabled = ibusInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_JETIEXBUS
//    case SERIALRX_JETIEXBUS:
//        enabled = jetiExBusInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_CRSF
//    case SERIALRX_CRSF:
//        enabled = crsfRxInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_TARGET_CUSTOM
//    case SERIALRX_TARGET_CUSTOM:
//        enabled = targetCustomSerialRxInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//#ifdef USE_SERIALRX_FPORT
//    case SERIALRX_FPORT:
//        enabled = fportRxInit(rxConfig, rxRuntimeState);
//        break;
//#endif
//    default:
//        enabled = false;
//        break;
//    }
//    return enabled;
//}
//#endif

