paparazzi/paparazzi/sw/airborne/subsystems/radio_control/cc2500_frsky/cc2500_rx.c
void rxInit(void)
{
    if (featureIsEnabled(FEATURE_RX_PARALLEL_PWM)) {
        rxRuntimeState.rxProvider = RX_PROVIDER_PARALLEL_PWM;
    } else if (featureIsEnabled(FEATURE_RX_PPM)) {
        rxRuntimeState.rxProvider = RX_PROVIDER_PPM;
    } else if (featureIsEnabled(FEATURE_RX_SERIAL)) {
        rxRuntimeState.rxProvider = RX_PROVIDER_SERIAL;
    } else if (featureIsEnabled(FEATURE_RX_MSP)) {
        rxRuntimeState.rxProvider = RX_PROVIDER_MSP;
    } else if (featureIsEnabled(FEATURE_RX_SPI)) {
        rxRuntimeState.rxProvider = RX_PROVIDER_SPI;
    } else {
        rxRuntimeState.rxProvider = RX_PROVIDER_NONE;
    }
//    rxRuntimeState.serialrxProvider = rxConfig()->serialrx_provider;
    rxRuntimeState.rcReadRawFn = nullReadRawRC;
    rxRuntimeState.rcFrameStatusFn = nullFrameStatus;
    rxRuntimeState.rcProcessFrameFn = nullProcessFrame;
    rcSampleIndex = 0;
    needRxSignalMaxDelayUs = DELAY_10_HZ;

    for (int i = 0; i < MAX_SUPPORTED_RC_CHANNEL_COUNT; i++) {
        rcData[i] = rxConfig()->midrc;
        rcInvalidPulsPeriod[i] = millis() + MAX_INVALID_PULS_TIME;
    }

//    rcData[THROTTLE] = (featureIsEnabled(FEATURE_3D)) ? rxConfig()->midrc : rxConfig()->rx_min_usec;

//    // Initialize ARM switch to OFF position when arming via switch is defined
//    // TODO - move to rc_mode.c
//    for (int i = 0; i < MAX_MODE_ACTIVATION_CONDITION_COUNT; i++) {
//        const modeActivationCondition_t *modeActivationCondition = modeActivationConditions(i);
//        if (modeActivationCondition->modeId == BOXARM && IS_RANGE_USABLE(&modeActivationCondition->range)) {
//            // ARM switch is defined, determine an OFF value
//            uint16_t value;
//            if (modeActivationCondition->range.startStep > 0) {
//                value = MODE_STEP_TO_CHANNEL_VALUE((modeActivationCondition->range.startStep - 1));
//            } else {
//                value = MODE_STEP_TO_CHANNEL_VALUE((modeActivationCondition->range.endStep + 1));
//            }
//            // Initialize ARM AUX channel to OFF value
//            rcData[modeActivationCondition->auxChannelIndex + NON_AUX_CHANNEL_COUNT] = value;
//        }
//    }

    switch (rxRuntimeState.rxProvider) {
    default:

        break;
#ifdef USE_SERIAL_RX
    case RX_PROVIDER_SERIAL:
        {
            const bool enabled = serialRxInit(rxConfig(), &rxRuntimeState);
            if (!enabled) {
                rxRuntimeState.rcReadRawFn = nullReadRawRC;
                rxRuntimeState.rcFrameStatusFn = nullFrameStatus;
            }
        }

        break;
#endif

#ifdef USE_RX_MSP
    case RX_PROVIDER_MSP:
        rxMspInit(rxConfig(), &rxRuntimeState);
        needRxSignalMaxDelayUs = DELAY_5_HZ;

        break;
#endif

#ifdef USE_RX_SPI
    case RX_PROVIDER_SPI:
        {
            const bool enabled = rxSpiInit(rxSpiConfig(), &rxRuntimeState);
            if (!enabled) {
                rxRuntimeState.rcReadRawFn = nullReadRawRC;
                rxRuntimeState.rcFrameStatusFn = nullFrameStatus;
            }
        }

        break;
#endif

#if defined(USE_PWM) || defined(USE_PPM)
    case RX_PROVIDER_PPM:
    case RX_PROVIDER_PARALLEL_PWM:
        rxPwmInit(rxConfig(), &rxRuntimeState);

        break;
#endif
    }

#if defined(USE_ADC)
    if (featureIsEnabled(FEATURE_RSSI_ADC)) {
        rssiSource = RSSI_SOURCE_ADC;
    } else
#endif
    if (rxConfig()->rssi_channel > 0) {
        rssiSource = RSSI_SOURCE_RX_CHANNEL;
    }

    // Setup source frame RSSI filtering to take averaged values every FRAME_ERR_RESAMPLE_US
    pt1FilterInit(&frameErrFilter, pt1FilterGain(GET_FRAME_ERR_LPF_FREQUENCY(rxConfig()->rssi_src_frame_lpf_period), FRAME_ERR_RESAMPLE_US/1000000.0));

    rxChannelCount = MIN(rxConfig()->max_aux_channel + NON_AUX_CHANNEL_COUNT, rxRuntimeState.channelCount);
}

//bool rxIsReceivingSignal(void)
//{
//    return rxSignalReceived;
//}
//
//bool rxAreFlightChannelsValid(void)
//{
//    return rxFlightChannelsValid;
//}
//
//void suspendRxPwmPpmSignal(void)
//{
//#if defined(USE_PWM) || defined(USE_PPM)
//    if (rxRuntimeState.rxProvider == RX_PROVIDER_PARALLEL_PWM || rxRuntimeState.rxProvider == RX_PROVIDER_PPM) {
//        suspendRxSignalUntil = micros() + SKIP_RC_ON_SUSPEND_PERIOD;
//        skipRxSamples = SKIP_RC_SAMPLES_ON_RESUME;
//        failsafeOnRxSuspend(SKIP_RC_ON_SUSPEND_PERIOD);
//    }
//#endif
//}
//
//void resumeRxPwmPpmSignal(void)
//{
//#if defined(USE_PWM) || defined(USE_PPM)
//    if (rxRuntimeState.rxProvider == RX_PROVIDER_PARALLEL_PWM || rxRuntimeState.rxProvider == RX_PROVIDER_PPM) {
//        suspendRxSignalUntil = micros();
//        skipRxSamples = SKIP_RC_SAMPLES_ON_RESUME;
//        failsafeOnRxResume();
//    }
//#endif
//}
//
//#ifdef USE_RX_LINK_QUALITY_INFO
//#define LINK_QUALITY_SAMPLE_COUNT 16
//
//STATIC_UNIT_TESTED uint16_t updateLinkQualitySamples(uint16_t value)
//{
//    static uint16_t samples[LINK_QUALITY_SAMPLE_COUNT];
//    static uint8_t sampleIndex = 0;
//    static uint16_t sum = 0;
//
//    sum += value - samples[sampleIndex];
//    samples[sampleIndex] = value;
//    sampleIndex = (sampleIndex + 1) % LINK_QUALITY_SAMPLE_COUNT;
//    return sum / LINK_QUALITY_SAMPLE_COUNT;
//}
//#endif

static void setLinkQuality(bool validFrame, timeDelta_t currentDeltaTime)
{
#ifdef USE_RX_LINK_QUALITY_INFO
    if (linkQualitySource != LQ_SOURCE_RX_PROTOCOL_CRSF) {
        // calculate new sample mean
        linkQuality = updateLinkQualitySamples(validFrame ? LINK_QUALITY_MAX_VALUE : 0);
    }
#endif

    if (rssiSource == RSSI_SOURCE_FRAME_ERRORS) {
        static uint16_t tot_rssi = 0;
        static uint16_t cnt_rssi = 0;
        static timeDelta_t resample_time = 0;

        resample_time += currentDeltaTime;
        tot_rssi += validFrame ? RSSI_MAX_VALUE : 0;
        cnt_rssi++;

        if (resample_time >= FRAME_ERR_RESAMPLE_US) {
            setRssi(tot_rssi / cnt_rssi, rssiSource);
            tot_rssi = 0;
            cnt_rssi = 0;
            resample_time -= FRAME_ERR_RESAMPLE_US;
        }
    }
}

