paparazzi/paparazzi/sw/airborne/subsystems/radio_control/cc2500_frsky/cc2500_rx.c
//void setLinkQualityDirect(uint16_t linkqualityValue)
//{
//#ifdef USE_RX_LINK_QUALITY_INFO
//    linkQuality = linkqualityValue;
//#else
//    UNUSED(linkqualityValue);
//#endif
//}

bool rxUpdateCheck(timeUs_t currentTimeUs, timeDelta_t currentDeltaTime)
{
    bool signalReceived = false;
    bool useDataDrivenProcessing = true;

    switch (rxRuntimeState.rxProvider) {
    default:

        break;
#if defined(USE_PWM) || defined(USE_PPM)
    case RX_PROVIDER_PPM:
        if (isPPMDataBeingReceived()) {
            signalReceived = true;
            rxIsInFailsafeMode = false;
            needRxSignalBefore = currentTimeUs + needRxSignalMaxDelayUs;
            resetPPMDataReceivedState();
        }

        break;
    case RX_PROVIDER_PARALLEL_PWM:
        if (isPWMDataBeingReceived()) {
            signalReceived = true;
            rxIsInFailsafeMode = false;
            needRxSignalBefore = currentTimeUs + needRxSignalMaxDelayUs;
            useDataDrivenProcessing = false;
        }

        break;
#endif
    case RX_PROVIDER_SERIAL:
    case RX_PROVIDER_MSP:
    case RX_PROVIDER_SPI:
        {
            const uint8_t frameStatus = rxRuntimeState.rcFrameStatusFn(&rxRuntimeState);
            if (frameStatus & RX_FRAME_COMPLETE) {
                rxIsInFailsafeMode = (frameStatus & RX_FRAME_FAILSAFE) != 0;
                bool rxFrameDropped = (frameStatus & RX_FRAME_DROPPED) != 0;
                signalReceived = !(rxIsInFailsafeMode || rxFrameDropped);
                if (signalReceived) {
                    needRxSignalBefore = currentTimeUs + needRxSignalMaxDelayUs;
                }

                setLinkQuality(signalReceived, currentDeltaTime);
            }

            if (frameStatus & RX_FRAME_PROCESSING_REQUIRED) {
                auxiliaryProcessingRequired = true;
            }
        }

        break;
    }

    if (signalReceived) {
        rxSignalReceived = true;
    } else if (currentTimeUs >= needRxSignalBefore) {
        rxSignalReceived = false;
    }

    if ((signalReceived && useDataDrivenProcessing) || cmpTimeUs(currentTimeUs, rxNextUpdateAtUs) > 0) {
        rxDataProcessingRequired = true;
    }

    return rxDataProcessingRequired || auxiliaryProcessingRequired; // data driven or 50Hz
}

//#if defined(USE_PWM) || defined(USE_PPM)
//static uint16_t calculateChannelMovingAverage(uint8_t chan, uint16_t sample)
//{
//    static int16_t rcSamples[MAX_SUPPORTED_RX_PARALLEL_PWM_OR_PPM_CHANNEL_COUNT][PPM_AND_PWM_SAMPLE_COUNT];
//    static int16_t rcDataMean[MAX_SUPPORTED_RX_PARALLEL_PWM_OR_PPM_CHANNEL_COUNT];
//    static bool rxSamplesCollected = false;
//
//    const uint8_t currentSampleIndex = rcSampleIndex % PPM_AND_PWM_SAMPLE_COUNT;
//
//    // update the recent samples and compute the average of them
//    rcSamples[chan][currentSampleIndex] = sample;
//
//    // avoid returning an incorrect average which would otherwise occur before enough samples
//    if (!rxSamplesCollected) {
//        if (rcSampleIndex < PPM_AND_PWM_SAMPLE_COUNT) {
//            return sample;
//        }
//        rxSamplesCollected = true;
//    }
//
//    rcDataMean[chan] = 0;
//    for (int sampleIndex = 0; sampleIndex < PPM_AND_PWM_SAMPLE_COUNT; sampleIndex++) {
//        rcDataMean[chan] += rcSamples[chan][sampleIndex];
//    }
//    return rcDataMean[chan] / PPM_AND_PWM_SAMPLE_COUNT;
//}
//#endif
//
//static uint16_t getRxfailValue(uint8_t channel)
//{
//    const rxFailsafeChannelConfig_t *channelFailsafeConfig = rxFailsafeChannelConfigs(channel);
//
//    switch (channelFailsafeConfig->mode) {
//    case RX_FAILSAFE_MODE_AUTO:
//        switch (channel) {
//        case ROLL:
//        case PITCH:
//        case YAW:
//            return rxConfig()->midrc;
//        case THROTTLE:
//            if (featureIsEnabled(FEATURE_3D) && !IS_RC_MODE_ACTIVE(BOX3D) && !flight3DConfig()->switched_mode3d) {
//                return rxConfig()->midrc;
//            } else {
//                return rxConfig()->rx_min_usec;
//            }
//        }
//
//    FALLTHROUGH;
//    default:
//    case RX_FAILSAFE_MODE_INVALID:
//    case RX_FAILSAFE_MODE_HOLD:
//        return rcData[channel];
//
//    case RX_FAILSAFE_MODE_SET:
//        return RXFAIL_STEP_TO_CHANNEL_VALUE(channelFailsafeConfig->step);
//    }
//}
//
//STATIC_UNIT_TESTED uint16_t applyRxChannelRangeConfiguraton(int sample, const rxChannelRangeConfig_t *range)
//{
//    // Avoid corruption of channel with a value of PPM_RCVR_TIMEOUT
//    if (sample == PPM_RCVR_TIMEOUT) {
//        return PPM_RCVR_TIMEOUT;
//    }
//
//    sample = scaleRange(sample, range->min, range->max, PWM_RANGE_MIN, PWM_RANGE_MAX);
//    sample = constrain(sample, PWM_PULSE_MIN, PWM_PULSE_MAX);
//
//    return sample;
//}
//
//static void readRxChannelsApplyRanges(void)
//{
//    for (int channel = 0; channel < rxChannelCount; channel++) {
//
//        const uint8_t rawChannel = channel < RX_MAPPABLE_CHANNEL_COUNT ? rxConfig()->rcmap[channel] : channel;
//
//        // sample the channel
//        uint16_t sample = rxRuntimeState.rcReadRawFn(&rxRuntimeState, rawChannel);
//
//        // apply the rx calibration
//        if (channel < NON_AUX_CHANNEL_COUNT) {
//            sample = applyRxChannelRangeConfiguraton(sample, rxChannelRangeConfigs(channel));
//        }
//
//        rcRaw[channel] = sample;
//    }
//}
//
//static void detectAndApplySignalLossBehaviour(void)
//{
//    const uint32_t currentTimeMs = millis();
//
//    const bool useValueFromRx = rxSignalReceived && !rxIsInFailsafeMode;
//
//    DEBUG_SET(DEBUG_RX_SIGNAL_LOSS, 0, rxSignalReceived);
//    DEBUG_SET(DEBUG_RX_SIGNAL_LOSS, 1, rxIsInFailsafeMode);
//
//    rxFlightChannelsValid = true;
//    for (int channel = 0; channel < rxChannelCount; channel++) {
//        uint16_t sample = rcRaw[channel];
//
//        const bool validPulse = useValueFromRx && isPulseValid(sample);
//
//        if (validPulse) {
//            rcInvalidPulsPeriod[channel] = currentTimeMs + MAX_INVALID_PULS_TIME;
//        } else {
//            if (cmp32(currentTimeMs, rcInvalidPulsPeriod[channel]) < 0) {
//                continue;           // skip to next channel to hold channel value MAX_INVALID_PULS_TIME
//            } else {
//                sample = getRxfailValue(channel);   // after that apply rxfail value
//                if (channel < NON_AUX_CHANNEL_COUNT) {
//                    rxFlightChannelsValid = false;
//                }
//            }
//        }
//#if defined(USE_PWM) || defined(USE_PPM)
//        if (rxRuntimeState.rxProvider == RX_PROVIDER_PARALLEL_PWM || rxRuntimeState.rxProvider == RX_PROVIDER_PPM) {
//            // smooth output for PWM and PPM
//            rcData[channel] = calculateChannelMovingAverage(channel, sample);
//        } else
//#endif
//        {
//            rcData[channel] = sample;
//        }
//    }
//
//    if (rxFlightChannelsValid && !IS_RC_MODE_ACTIVE(BOXFAILSAFE)) {
//        failsafeOnValidDataReceived();
//    } else {
//        rxIsInFailsafeMode = true;
//        failsafeOnValidDataFailed();
//        for (int channel = 0; channel < rxChannelCount; channel++) {
//            rcData[channel] = getRxfailValue(channel);
//        }
//    }
//    DEBUG_SET(DEBUG_RX_SIGNAL_LOSS, 3, rcData[THROTTLE]);
//}
//
//bool calculateRxChannelsAndUpdateFailsafe(timeUs_t currentTimeUs)
//{
//    if (auxiliaryProcessingRequired) {
//        auxiliaryProcessingRequired = !rxRuntimeState.rcProcessFrameFn(&rxRuntimeState);
//    }
//
//    if (!rxDataProcessingRequired) {
//        return false;
//    }
//
//    rxDataProcessingRequired = false;
//    rxNextUpdateAtUs = currentTimeUs + DELAY_33_HZ;
//
//    // only proceed when no more samples to skip and suspend period is over
//    if (skipRxSamples || currentTimeUs <= suspendRxSignalUntil) {
//        if (currentTimeUs > suspendRxSignalUntil) {
//            skipRxSamples--;
//        }
//
//        return true;
//    }
//
//    readRxChannelsApplyRanges();
//    detectAndApplySignalLossBehaviour();
//
//    rcSampleIndex++;
//
//    return true;
//}
//
//void parseRcChannels(const char *input, rxConfig_t *rxConfig)
//{
//    for (const char *c = input; *c; c++) {
//        const char *s = strchr(rcChannelLetters, *c);
//        if (s && (s < rcChannelLetters + RX_MAPPABLE_CHANNEL_COUNT)) {
//            rxConfig->rcmap[s - rcChannelLetters] = c - input;
//        }
//    }
//}

