paparazzi/paparazzi/sw/airborne/subsystems/radio_control/cc2500_frsky/cc2500_rx.c
void setRssiDirect(uint16_t newRssi, rssiSource_e source)
{
    if (source != rssiSource) {
        return;
    }

    rssi = newRssi;
}

#define RSSI_SAMPLE_COUNT 16

static uint16_t updateRssiSamples(uint16_t value)
{
    static uint16_t samples[RSSI_SAMPLE_COUNT];
    static uint8_t sampleIndex = 0;
    static unsigned sum = 0;

    sum += value - samples[sampleIndex];
    samples[sampleIndex] = value;
    sampleIndex = (sampleIndex + 1) % RSSI_SAMPLE_COUNT;
    return sum / RSSI_SAMPLE_COUNT;
}

void setRssi(uint16_t rssiValue, rssiSource_e source)
{
    if (source != rssiSource) {
        return;
    }

    // Filter RSSI value
    if (source == RSSI_SOURCE_FRAME_ERRORS) {
        rssi = pt1FilterApply(&frameErrFilter, rssiValue);
    } else {
        // calculate new sample mean
        rssi = updateRssiSamples(rssiValue);
    }
}

//void setRssiMsp(uint8_t newMspRssi)
//{
//    if (rssiSource == RSSI_SOURCE_NONE) {
//        rssiSource = RSSI_SOURCE_MSP;
//    }
//
//    if (rssiSource == RSSI_SOURCE_MSP) {
//        rssi = ((uint16_t)newMspRssi) << 2;
//        lastMspRssiUpdateUs = micros();
//    }
//}
//
//static void updateRSSIPWM(void)
//{
//    // Read value of AUX channel as rssi
//    int16_t pwmRssi = rcData[rxConfig()->rssi_channel - 1];
//
//    // RSSI_Invert option
//    if (rxConfig()->rssi_invert) {
//        pwmRssi = ((2000 - pwmRssi) + 1000);
//    }
//
//    // Range of rawPwmRssi is [1000;2000]. rssi should be in [0;1023];
//    setRssiDirect(constrain(((pwmRssi - 1000) / 1000.0f) * RSSI_MAX_VALUE, 0, RSSI_MAX_VALUE), RSSI_SOURCE_RX_CHANNEL);
//}
//
//static void updateRSSIADC(timeUs_t currentTimeUs)
//{
//#ifndef USE_ADC
//    UNUSED(currentTimeUs);
//#else
//    static uint32_t rssiUpdateAt = 0;
//
//    if ((int32_t)(currentTimeUs - rssiUpdateAt) < 0) {
//        return;
//    }
//    rssiUpdateAt = currentTimeUs + DELAY_50_HZ;
//
//    const uint16_t adcRssiSample = adcGetChannel(ADC_RSSI);
//    uint16_t rssiValue = adcRssiSample / RSSI_ADC_DIVISOR;
//
//    // RSSI_Invert option
//    if (rxConfig()->rssi_invert) {
//        rssiValue = RSSI_MAX_VALUE - rssiValue;
//    }
//
//    setRssi(rssiValue, RSSI_SOURCE_ADC);
//#endif
//}
//
//void updateRSSI(timeUs_t currentTimeUs)
//{
//    switch (rssiSource) {
//    case RSSI_SOURCE_RX_CHANNEL:
//        updateRSSIPWM();
//        break;
//    case RSSI_SOURCE_ADC:
//        updateRSSIADC(currentTimeUs);
//        break;
//    case RSSI_SOURCE_MSP:
//        if (cmpTimeUs(micros(), lastMspRssiUpdateUs) > MSP_RSSI_TIMEOUT_US) {
//            rssi = 0;
//        }
//        break;
//    default:
//        break;
//    }
//}
//
//uint16_t getRssi(void)
//{
//    return rxConfig()->rssi_scale / 100.0f * rssi + rxConfig()->rssi_offset * RSSI_OFFSET_SCALING;
//}
//
//uint8_t getRssiPercent(void)
//{
//    return scaleRange(getRssi(), 0, RSSI_MAX_VALUE, 0, 100);
//}
//
//uint8_t getRssiDbm(void)
//{
//    return rssi_dbm;
//}
//
//#define RSSI_SAMPLE_COUNT_DBM 16
//
//static uint8_t updateRssiDbmSamples(uint8_t value)
//{
//    static uint16_t samplesdbm[RSSI_SAMPLE_COUNT_DBM];
//    static uint8_t sampledbmIndex = 0;
//    static unsigned sumdbm = 0;
//
//    sumdbm += value - samplesdbm[sampledbmIndex];
//    samplesdbm[sampledbmIndex] = value;
//    sampledbmIndex = (sampledbmIndex + 1) % RSSI_SAMPLE_COUNT_DBM;
//    return sumdbm / RSSI_SAMPLE_COUNT_DBM;
//}
//
//void setRssiDbm(uint8_t rssiDbmValue, rssiSource_e source)
//{
//    if (source != rssiSource) {
//        return;
//    }
//
//    rssi_dbm = updateRssiDbmSamples(rssiDbmValue);
//}
//
//void setRssiDbmDirect(uint8_t newRssiDbm, rssiSource_e source)
//{
//    if (source != rssiSource) {
//        return;
//    }
//
//    rssi_dbm = newRssiDbm;
//}
//
//#ifdef USE_RX_LINK_QUALITY_INFO
//uint16_t rxGetLinkQuality(void)
//{
//    return linkQuality;
//}
//
//uint16_t rxGetLinkQualityPercent(void)
//{
//    return (linkQualitySource == LQ_SOURCE_RX_PROTOCOL_CRSF) ?  (linkQuality / 3.41) : scaleRange(linkQuality, 0, LINK_QUALITY_MAX_VALUE, 0, 100);
//}
//#endif
//
//uint16_t rxGetRefreshRate(void)
//{
//    return rxRuntimeState.rxRefreshRate;
//}
//
//bool isRssiConfigured(void)
//{
//    return rssiSource != RSSI_SOURCE_NONE;
//}
//
//bool rxGetFrameDelta(timeDelta_t *deltaUs)
//{
//    if (rxRuntimeState.rcFrameDeltaFn) {
//        *deltaUs = rxRuntimeState.rcFrameDeltaFn();
//        return true;
//    }
//    return false;  // No frame delta function available for protocol type
//}
